## Ultralytics YOLO 🚀, AGPL-3.0 license
## YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
#
## Parameters
#nc: 80 # number of classes
#scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
#  # [depth, width, max_channels]
#  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
#  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
#  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
#
## YOLO11n backbone
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#  - [-1, 1, CBAM, []]  # 2 添加CBAM，增强浅层细节特征
#  - [-1, 2, C3k2, [256, False, 0.25]]  # 3
#  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
#  - [-1, 1, CBAM, []]  # 5 添加CBAM，增强中层特征
#  - [-1, 2, C3k2, [512, False, 0.25]]  # 6
#  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
#  - [-1, 1, CBAM, []]  # 8 添加CBAM，增强中层特征
#  - [-1, 2, C3k2, [512, True]]  # 9
#  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
#  - [-1, 2, C3k2, [1024, True]]  # 11
#  - [-1, 1, SPPF, [1024, 5]] # 12
#  - [-1, 2, C2PSA, [1024]] # 13
#
## YOLO11n head
#head:
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 9], 1, Concat, [1]] # cat backbone P4 (原来是6，现在是9)
#  - [-1, 2, C3k2, [512, False]] # 16
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 (原来是4，现在是6)
#  - [-1, 2, C3k2, [256, False]] # 19 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 16], 1, Concat, [1]] # cat head P4 (原来是13，现在是16)
#  - [-1, 2, C3k2, [512, False]] # 22 (P4/16-medium)
#
#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 13], 1, Concat, [1]] # cat head P5
#  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)
#
#  - [[19, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5) (原来是[16, 19, 22])

 Ultralytics YOLO 🚀, AGPL-3.0 license
 YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 Ultralytics YOLO 🚀, AGPL-3.0 license
 YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, Conv, [128, 1, 1]]  # 4 特征调整
  - [-1, 1, CBAM, []]  # 5
  - [-1, 2, C3k2, [256, False, 0.25]]  # 6

  - [-1, 1, Conv, [256, 3, 2]]  # 7-P4/16
  - [-1, 1, Conv, [512, 1, 1]]  # 8 特征调整
  - [-1, 1, Conv, [256, 1, 1]]  # 9 特征调整
  - [-1, 1, CBAM, []]  # 10
  - [-1, 2, C3k2, [512, False, 0.25]]  # 11

  - [-1, 1, Conv, [512, 3, 2]]  # 12-P5/32
  - [-1, 1, Conv, [1024, 1, 1]]  # 13 特征调整
  - [-1, 1, Conv, [512, 1, 1]]  # 14 特征调整
  - [-1, 1, CBAM, []]  # 15
  - [-1, 2, C3k2, [512, True]]  # 16

  - [-1, 1, Conv, [1024, 1, 1]]  # 17
  - [-1, 2, C3k2, [1024, True]]  # 18
  - [-1, 1, SPPF, [1024, 5]]  # 19
  - [-1, 2, C2PSA, [1024]]  # 20

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 23

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 23], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 29 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 32 (P5/32-large)

  - [[26, 29, 32], 1, Detect, [nc]]  # Detect(P3, P4, P5)
#nc: 80 # number of classes
#scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
#  # [depth, width, max_channels]
#  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
#  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
#  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
#
### YOLO11n backbone with ControlNet-like structure
#backbone:
#  # [from, repeats, module, args]
#  # First stage
#  - [-1, 1, Conv, [64, 1, 1]]  # 0 Zero Conv
#
#  # Original Conv (locked) + Control Conv (trainable) + Add
#  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2 Original Conv (locked)
#  - [-2, 1, Conv, [64, 3, 2]]  # 2 Control Conv (trainable)
##  - [[-2, -1], 1, Add, []]  # 3 Add features (original, control)
#
#  - [-1, 1, Conv, [128, 3, 2]]  # 4 Original Conv (locked) 3
#  - [-2, 1, Conv, [128, 3, 2]]  # 5 Control Conv (trainable) 4
##  - [[-2, -1], 1, Add, []]  # 6 Add features (original, control)
#
#  # Zero Conv and CBAM
#  - [-1, 1, Conv, [128, 1, 1]]  # 7 Zero Conv 5
#  - [-1, 1, CBAM, []]  # 8 6
#  - [-1, 2, C3k2, [256, False, 0.25]]  # 9 7
#
#  # Second stage
#  - [-1, 1, Conv, [256, 1, 1]]  # 10 Zero Conv 8
#  - [-1, 1, Conv, [256, 3, 2]]  # 11 Original Conv (locked) p3 9
#  - [-2, 1, Conv, [256, 3, 2]]  # 12 Control Conv (trainable)  10
##  - [[-2, -1], 1, Add, []]  # 13 Add features (original, control)
#  # Zero Conv and CBAM
#  - [-1, 1, Conv, [256, 1, 1]]  # 14 Zero Conv 11
#  - [-1, 1, CBAM, []]  # 15  12
#  - [-1, 2, C3k2, [512, False, 0.25]]  # 16  13
#
#  # Third stage
#  - [-1, 1, Conv, [512, 1, 1]]  # 17 Zero Conv  14
#  - [-1, 1, Conv, [512, 3, 2]]  # 18 Original Conv (locked)  p4  15
#  - [-2, 1, Conv, [512, 3, 2]]  # 19 Control Conv (trainable)  16
##  - [[-1, -2], 1, Add, []]  # 20 Add features
#  # Zero Conv and CBAM
#  - [-1, 1, Conv, [512, 1, 1]]  # 21 Zero Conv  17
#  - [-1, 1, CBAM, []]  # 22  18
#  - [-1, 2, C3k2, [512, True]]  # 23  19
#
#  # Fourth stage
#  - [-1, 1, Conv, [1024, 1, 1]]  # 24 Zero Conv  20
#  - [-1, 1, Conv, [1024, 3, 2]]  # 25 Original Conv (locked) p5  21
#  - [-2, 1, Conv, [1024, 3, 2]]  # 26 Control Conv (trainable)  22
##  - [[-1, -2], 1, Add, []]  # 27 Add features  23
#  - [-1, 2, C3k2, [1024, True]]  # 28   23
#  - [-1, 1, SPPF, [1024, 5]]  # 29  24
#  # Zero Conv and C2PSA
#  - [-1, 2, C2PSA, [1024]]  # 30  25
#  - [-1, 1, Conv, [1024, 1, 1]]  # 31 Zero Conv  26
#
## YOLO11n head
#head:
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 32  27
##  - [[-1, 19], 1, Concat, [1]]  # cat backbone P4 # 33  28
#  - [[-1, 16], 1, Concat, [1]]  # cat backbone P4 # 33  28
#  - [-1, 2, C3k2, [512, False]]  # 34  29
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 35  30
##  - [[-1, 12], 1, Concat, [1]]  # cat backbone P3 # 36  31
#  - [[-1, 10], 1, Concat, [1]]  # cat backbone P3 # 36  31
#  - [-1, 2, C3k2, [256, False]]  # 37 (P3/8-small)  32
#
#  - [-1, 1, Conv, [256, 3, 2]] # 38  33
##  - [[-1, 34], 1, Concat, [1]]  # cat head P4 # 39  34
#  - [[-1, 29], 1, Concat, [1]]  # cat head P4 # 39  34
#  - [-1, 2, C3k2, [512, False]]  # 40 (P4/16-medium)  35
#
#  - [-1, 1, Conv, [512, 3, 2]] # 41  36
##  - [[-1, 31], 1, Concat, [1]]  # cat head P5 # 42  37
#  - [[-1, 26], 1, Concat, [1]]  # cat head P5 # 42  37
#  - [-1, 2, C3k2, [1024, True]]  # 43 (P5/32-large)  38
#
#  - [[32, 35, 38], 1, Detect, [nc]]  # Detect(P3, P4, P5) # 44  39
##  - [[37, 40, 43], 1, Detect, [nc]]  # Detect(P3, P4, P5) # 44  39
